# "For Loop" გამოყენება ყველაზე ხშირად ხდება მაშინ, როდესაც ჩვენ ვიცით, რამდენიiterations (ბრუნვა) უნდა შესრულდეს.
# ეს ნიშნავს, რომ თუ გვაქვს კონკრეტული რაოდენობის ელემენტები, ან გარკვეული რაოდენობა ნაბიჯების გადადგმა უნდა შევასრულოთ, 
# "for" ციკლი არის იდეალური გამოსავალი.
#
# მაგალითად:
# 1. როდესაც გვინდა გამოვიტანოთ თითოეული ელემენტი სიიდან
# 2. როდესაც ვიცით, რამდენი ნაბიჯი უნდა გადადგას პროგრამამ (რიცხვების დიაპაზონი ან სტრიქონის სიგრძე)
# 3. როდესაც გვაქვს წინასწარ განსაზღვრული რაოდენობა განსაზღვრული ნაბიჯების ან ოპერაციების შესრულებისთვის
