#2)ახსენით რაც დღეს გავიარეთ (isalnum,isdigit,islower,isnumeric,isupper,count) მეთოდები თითოეული რას აკეთებს.

#isalnum()-- აბრუნებს true ს იმ შემთხვევაში  როდესაც სტრინგში არის ან რიცხვი ან ასო (ან ორივე)
#isdigit()-- აბრუნებს true ს იმ შემთხვევაში თუ სტრინგი შედგება მხოლოდ რიცხვისგა სხვა შემთხვევაში დაგვიბრუნებს falss
#islower()-- აბრუნებს true ს იმ შემთხვევაში თუ სტრინგი შედგება პატარა ასოებისგან
#isnumeric()-- 
#isupper()-- აბრუნებს   true ს იმ შმთხვევაში თუ სტრინგი შედგება დიდი ასებისგან
#count()--აბრუნებს სტრინგში რამდენჯერ მეორდება კონკრეტული სიმბოლო
#isnumeric()--მეთოდი აბრუნებს True-ს, თუ ყველა სიმბოლო არის რიცხვითი (0-9), წინააღმდეგ შემთხვევაში False.