#.insert(): ამ ფუნქციით შეგიძლიათ დაამატოთ ელემენტი კონკრეტულ ინდექსზე სიის შიგნით. სინტაქსი: list.insert(index, element) - სადაც index არის ადგილი სიის შიგნით და element არის ის ელემენტი, რომელიც უნდა დაემატოს.

#.append(): ამ ფუნქციით ემატება ელემენტი სიის ბოლო ინდექსზე. სინტაქსი: list.append(element) - სადაც element არის ის ელემენტი, რომელიც უნდა დაემატოს.

#pop(): ამ ფუნქციით ამოიღებთ ელემენტს კონკრეტული ინდექსით ან, თუ ინდექსი არ არის მითითებული, სიის ბოლო ელემენტს ამოიღებთ. სინტაქსი: list.pop(index) - სადაც index არის ის ადგილი სიის შიგნით, საიდანაც უნდა ამოიღოთ ელემენტი.

#.len(): ამ ფუნქცია ითვლის სიის ზომას, ანუ რამდენი ელემენტია სიაში. სინტაქსი: len(list).