#ფუნქცია: ფუნქცია არის კოდი, რომელიც შერჩეულ ოპერაციებს ასრულებს და შეიძლება იყოს შემოწერილი ერთი სახით, რომლის აღსრულებაც შესაძლებელია სხვადასხვა ადგილას. ფუნქციები ჩვენ გვაძლევს შესაძლებლობას გავამარტივოთ და გავმეორდეთ იმავე ოპერაციებს სხვადასხვა ადგილებში.

#უნქციების ტიპები:

#print() - გამოიტანს მონაცემებს კონსოლზე
#len() - აბრუნებს ობიექტის სიგრძეს (მაგ. სიის რაოდენობა)
#range() - ქმნის რიცხვების სერიას
#nput() - იღებს მონაცემებს მომხმარებლისგან
#type() - აბრუნებს ტიპს



# მაგალითი:
def greet(name):
    print(f"Hello, {name}!")
greet("John")  # Hello, John!
