#Indexing: ეს არის მეთოდი, როდესაც ჩვენ კონკრეტულ ელემენტს ვიღებთ სიის ან სხვა კოლექციიდან მისი ინდექსის მეშვეობით. ინდექსი განსაზღვრავს ელემენტის პოზიციას სიის მასივში. მაგალითად, ინდექსითაც შეიძლება მივიღოთ მხოლოდ ერთი ელემენტი (რიცხვი ან სიმბოლო).

# მაგალითი:
my_list = [10, 20, 30, 40, 50]
print(my_list[2])  # 30 - აქ ჩვენ მივიღებთ მხოლოდ ინდექსით მითითებულ ელემენტს




#Slicing: ეს არის მეთოდი, რომელიც საშუალებას გვაძლევს ავიღოთ სიის ან სხვა კოლექციის ელემენტების ნაწილობრივი ნაწილი. slicing საშუალებას გვაძლევს გადავიტანოთ მინის მთელი დიაპაზონი, მაგალითად, ელემენტებიდან 2-დან 5-მდე.



# მაგალითი:
my_list = [10, 20, 30, 40, 50]
print(my_list[1:4])  # [20, 30, 40] - აქ ჩვენ გამოვიყენეთ slicing და მივიღეთ ელემენტების ნაწილი
