#.lower() - ცვლიდა ყველა ასოს პატარა ასოებად. მაგალითად: "Hello".lower() გამოიტანებს "hello".
#.upper() - ცვლიდა ყველა ასოს დიდი ასოებად. მაგალითად: "hello".upper() გამოიტანავს "HELLO".
#.capitalize() - პირველ ასოს ქმნის დიდ ასოდ, დანარჩენებს კი პატარა ასოებად. მაგალითად: "hello".capitalize() გამოიტანავს "Hello".
#.find() - ეძებს ამოცანას სტრინგში და ან return-ავს პირველი ამოსული ასოს ინდექსს, ან -1-ს, თუ არ მოიძებნება. მაგალითად: "hello".find('e') გამოიტანავს 1, რადგან 'e' არის სტრინგის მეორე ასო.