#მომხმარებელს შემოატანინეთ მისი სახელი, შემოატანინეთ მისი ასაკი, ასევე სიმაღლე და შეამოწმეთ თუ მომხმარებლის ასაკი მეტია 18 და მისი სახელი უდრის თქვენს სახელს და ასევე მისი სიმაღლე მეტია 1.80-ზე

name = input("შეიტანეთ თქვენი სახელი: ")
age = int(input("შეიტანეთ თქვენი ასაკი: "))
height = float(input("შეიტანეთ თქვენი სიმაღლე (მეტრებში): "))


if age > 18 and name == "პაატა" and height > 1.80:
    print("გილოცავთ! თქვენ აკმაყოფილებთ ყველა პირობას.")
else:
    print("თქვენ არ აკმაყოფილებთ ყველა პირობას.")
