
# ალგორითმი არის პრობლების ამოხსნის პროცესი, რომლის დროსაც დეტალურად იწერება ნაბიჯები იმისათვის, რომ მოვაგვაროთ გარკვეული დავალება. ალგორითმი არ არის მხოლოდ პროგრამირება, არამედ გამოიყენება ყველა სფეროში, სადაც საჭირო ხდება პრობლემის გადაჭრა კონკრეტული წესებით და ნაბიჯებით.

# მაგალითად:
# 1. როგორ მოვიმზადოთ ყავა:
#  აადუღე წყალი
#  ჩაყარე ყავა და შაქარი ჭიქაში
#  დაასხი ადუღებული წყალი ჭიქაში
#  მოვურიოთ რომ გაისნას წყალში ყავა და შაქარი
#  და მივირთვათ

# 2. როგორ დავალაგოთ ოთახი:
#  აიღეთ ყველა ნივთი ოთახიდან
#  ჩამოწმინდეთ მტვერი
#  მოათავსე ნივთები სწორ ადგილზე
#  დაალაგე საწოლი
#  დაასრულე ოთახის დალაგება.

