
# ალგორითმი არის პრობლების ამოხსნის პროცესი, რომლის დროსაც დეტალურად იწერება ნაბიჯები
# იმისათვის, რომ მოვაგვაროთ გარკვეული დავალება. ალგორითმი არ არის მხოლოდ პროგრამირება,
# არამედ გამოიყენება ყველა სფეროში, სადაც საჭირო ხდება პრობლემის გადაჭრა კონკრეტული წესებით და ნაბიჯებით.

# მაგალითად:
# 1. როგორ ვიმზადოთ ყავა:
# - ადუღე წყალი
# - დააყენე ყავა ყავის ფილტრაში
# - დაასხი ადუღებული წყალი ყავის ფილტრში
# - დაელოდე, სანამ ყავა დაყენდება
# - დააყენე ყავის ჭიქაში და მიირთვი.

# 2. როგორ დავალაგოთ ოთახი:
# - ამოიღე ყველა ნივთი ოთახიდან
# - ჩამოწიე მტვერი
# - მოათავსე ნივთები სწორ ადგილებზე
# - დაალაგე საწოლი
# - დაასრულე ოთახის დალაგება.

# 3. როგორ მოამზადო რბილი სკამი:
# - აიღე ბამბუკის ძირი
# - მონახე ფორმა და სტრუქტურა, რომელიც შესაფერისია
# - დაჭერი და დაამონტაჟე რბილი საჰაერო იატაკი
# - დაიჭირე და დამაგრე ქსოვილი
# - დააწყვე სკამი ადგილზე.

