#2)მოხმარებელს შემოატანინეთ თავის სახელი,გვარი,ასაკი,ჰობბი და ბალანსი შემდეგ ეს ყველაფერი დაბეჭდეთ print-ის საშუალებით
# მომხმარებლის მონაცემების მიღება
first_name = input("შეიყვანეთ თქვენი სახელი: ")
last_name = input("შეიყვანეთ თქვენი გვარი: ")
age = int(input("შეიყვანეთ თქვენი ასაკი: "))
hobby = input("შეიყვანეთ თქვენი ჰობი: ")
balance = float(input("შეიყვანეთ თქვენი ბალანსი: "))

# მონაცემების დაბეჭდვა
print(f"სახელი: {first_name}\გვარი: {last_name}\ასაკი: {age}\ჰობი: {hobby}\nბალანსი: {balance}")
